tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Fish: amazing autocomplete-based modern shell
brew "fish"
# Git: decentralized version control system
brew "git"
brew "git-lfs"
# mas: CLI for Mac App Store
brew "mas"
# SwiftLint: third-party code quality linter for Swift
brew "swiftlint"
# youtube-dl: Download videos from YouTube
brew "youtube-dl"

# CodeRunner: simple IDE for quick type-and-run programs
cask "coderunner"
# GitUp: Blazingly fast, rational Git GUI
cask "gitup"
# Paw: HTTP client
cask "paw"
# Purple Safari!
cask "safari-technology-preview"
# Sketch: vector drawing app
cask "sketch"
# Transmit: really good remote disk management
cask "transmit"
# VLC: play all sources of audio and video
cask "vlc"
# Creative Cloud: The virus that gives me photoshop
cask "adobe-creative-cloud"
# Charles: rad web debugging proxy
cask "charles"
# UI for looking at SQLite files
cask "db-browser-for-sqlite"
# Markdown slides
cask "deckset"
# hashtag gamer chat
cask "discord"
# good general code editor
cask "visual-studio-code"
# my brain lives in here
cask "omnifocus"

mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "xScope", id: 889428659
mas "ToothFairy", id: 1191449274
mas "Screens 4", id: 1224268771
mas "Xcode", id: 497799835
mas "Marked 2", id: 890031187